using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp6
{
  class answers
  {
    /*
    1. Можно если пользоватся Методом String.Replace создает новый объект string.Метод Replace может заменять строки или отдельные символы.
    ------------------------------------------------------------------------------------------------------------------------------------------------------
    3.Стерелизация это преврашение обектов в баиты для импортирования в файлы или базы данных. Пример в Program.cs
    ------------------------------------------------------------------------------------------------------------------------------------------------------
    2.Если говорить кратко, то это система, предоставляющая выполняющему коду информацию о нём же самом. То есть позволяет читать выполняющему коду информацию о метаданных, которые он генерирует.
    ------------------------------------------------------------------------------------------------------------------------------------------------------
    6.Nullable-типы Иногда бывают ситуации, когда необходимо чтобы тип значений мог принимать null, и это можно сделать, указав знак вопроса (?) после имени типа, при объявлении переменной:
    ------------------------------------------------------------------------------------------------------------------------------------------------------
    5.плюсы интерфейса то что он более гипки 
    ------------------------------------------------------------------------------------------------------------------------------------------------------
    4.interface IAnswer<T> where T: IDisposable
    */













  }
}
